{
	"Meta(Acqusition)": {
		"doc_id": "TSIS-minute-00001",
		"doc_category": "REPORT",
		"doc_type": "minute",
		"doc_name": "TSIS회의1 - ERP회의",
		"author": null,
		"publisher": null,
		"publisher_year": null,
		"doc_origin": "TSIS"
	},
	"Meta(Refine)": {
		"passage_id": "REPORT-minute-00001-00001",
		"passage": "화자1] 많은 것 중에 거기 매뉴얼이 있더라고요. 화자2] 운영 계획에 붙은 게 있나 운영계획 붙을 수 있잖아요. 화자3] 개발계는 근데 못 붙어요. 저기 자체가 개발계 원격으로 붙으면 화자3] 그걸 모르겠어 봐야 될 것 같은데 죽어 있나 화자2] 아니면 그것만 다운 받아갖고 달라고 해도 되고요. 화자3] 매뉴얼이 HTML 페이지예요. 그래서 화자3] PPT 이런 거 다 가 아니라 여기서 여기서 안 될 수도 있겠네 운영하는 방법 알면 알겠지 그래서 화자2] 저희는 금요일 금요일 날 담당하는 운동은 목요일 날 안다고 화자2] 제가 정리해서 물어볼 거 있으면 물어볼게요. 정리한 거는 취합할까요? 다 노트북 가져가실 것도 아니고 화자3] 가서 어쨌든 보여주려면 누군가는 노트북 들고 가서 저희 노트북 켜야 될 것 같아요. 제가 누군가 보내놓고 할 것도 아니고 화자3] 본인 나도 신용주 매니저가 자기 노트북 가 볼 것 같지 않고 그렇죠 좀 연초 고 화자2] 엑셀 같은 거나 그럼 이 양식으로 다 대체로 이 양식으로 화자2] 작성해서 보면 취합해서 이렇게 물어볼까봐요. 이렇게 작성해서 화자3] 주시죠. 자 코드 의미가 궁금합니다. 이렇게 물어보면 화자3] 근데 저거 제가 적은 건데 저건 ERP의 정의서에 있긴 있는데 ERP의 의미를 모르겠어요. 세 가지가 있는데 화자3] 이제 퍼지면 차 퍼지죠 막 이러면 회사 코드 거래처코드 고객사 거래처 코드 화자2] 근데 연 연동 파트에도 화자2] 이렇게 있어가지고 보니까 회사 연동 이건 빌딩 거거든요. 여기도 보면 회사 코드 공룡 코드가 있는데 화자2] 이렇게 거기는 그냥 그냥 다 하드 코딩으로 이해하고 있더라고요. 화자3] 그냥 하드 코딩으로 저도 이해는 되는데 그래도 정확한 의미를 조금 알고 있어야지 나중에 좀 소통이나 이런 거 할 때 그냥 화자3] 하드 코딩 하면 될 것 같아요. 그래도 한번 ERP 쪽에 화자2] 하드 코딩이냐 고정 값이냐 하고 물어보긴 했는데 이런 거 다 그냥 보면은 회사 코드 공정 코드 다 이걸 그냥 동일하게 그냥 1100으로 박아버리는 화자2] 아예 질문도 안 하더라고요. 100이네 이거 근데 얘는 그냥 예시 값이고 고정 값이 아닌데 고정 값은 고정 값이라고 해놨던데 얘는 화자2] 그냥 이거에 그냥 예시인 줄 알았거든요. 저는 화자3] 저게 항상 보다 보면 고정 값은 맞는데 지금 저거 프로드랑 이것도 사실 여기 엑셀만 있는 거잖아요. 저희 거 연동 정세는 저희는 없잖아요. 화자3] 근데 1100으로만 알고 있다 보니까 운영은 천으로 날렸어야 돼 막 이래버리면은 화자2] 글쎄 의미를 이 같은 근데 우리는 고정은 고정이라고 명세서에 돼 있는데 의미를 알아야 저런 건 고정이라고 안 돼 있단 말이죠. 화자2] 뭔가 연동할 때 그런 시스템이 타는 게 화자3] 틀리다 이런 거는 화자2] 공장 예시로 넣어놨지 고정 값 이렇게 안 돼 있잖아요. 딴 건 고정은 다 고정이라고 해줬는데 한번 물어봐야 될 것 같은데 화자2] 이런 것들도 다 이제 한번 고정으로 돼 있는 건 모르겠는데 고정이 아닌 것들은 한 번씩 화자2] 의미를 모르겠으면 물어보시고 지금 아마 화면 찾아가고 테이블 따보면 거기에 없는 컬럼들 되게 많을 거예요. 아무리 찾아도 그 테이블들에서 화자2] 그럼 아마 다 물어봐야 되는 대상일 것 같고 제가 이제 했던 게 물어봤던 게 화자2] 화면 쿼리 따봤는데 암만 봐도 그거 컬럼 영어 못 찾겠는 거를 물어본 거였거든요. 저는 화자2] 다 모르겠던데 어떤 데 가 테이블에 하여튼 이거 최대한 각자 물어보시면 저희는 4명이 물어보면 세트니까 화자2] 컬럼에 대해서는 세트니까 업무에 대해서는 몰라도 화자2] 각자 고민하시고 물어보시고 대답 듣고 나서 연결해 보면 합쳐보면 뭐가 나와도 나오겠지 화자2] 그랬는데 두 분은 목요일 날 4시 시 저희 4명 금요일날 2시 ERP 쪽은 어떻게 화자2] 확인하려는 거예요? ERP는 화자2] 이번 주 중에 내려온다는 것 같아요. 그리고 저쪽은 어차피 물어보려고 해도 문서를 다음 말 풀어서 보내야 된다니까 화자2] 근데 우리는 못 푸니까 그때마다 신용준 매니저한테 계속 물어볼 수도 없고 그냥 내려오면 노트북 가서 갖고 와서 물어보는 걸로 그냥 가서 장덕진 인증이 화자2] 장국진 책임님 내려오시는지 누가 내려오시는지 모르겠어요. 다른 개발자 내려오고 하 화자3] 1~2명밖에 안 해요. 봐야 되겠네요. 저희 화자4] 몇 사람들이 왔다 갔다 하던데 화자4] 무슨 생각 드는데 이런 상황이 아 현재 화자4] 이렇게 ERP 넘겨주는 거 로우 데이터를 하더니 이렇게 들어가는구나 그거를 가지고 또 우리 역추적해가지고 넣는 부분도 확인할 수 있잖아요. 화자4] 이해 가요. 기타 입출구 같은 경우에 실질적으로 TRM 쪽에 화자4] 그런 정보 ERP 정보에 그 항목 칼럼이 이만큼 있지만 이만큼 없다고 들어가는 거 있잖아요. 데이터 들어가는 거 칼럼이 50개인데 한 10개만 들어간다. 화자5] 어떤 것도 어디 CRM DB요 화자4] ERP 쪽에 지금 화자2] 그거를 준 게 이 필수인데요. 화자4] 아니 뭐냐면 그런 것들을 물어보면 내부적으로 혹시 도움 되지 않을까 화자2] 이 문서가 이제 ERP에서 작성해 준 문서고 그렇게 돼 있는 거를 필수로 해서 준 거고 일단은 이게 TRN에서 작성해 준 게 아니라 이제 ERP에서 화자2] 준 거예요. 자기네 필요하다는 값은 필수 이거 아마 필수된 거 채워주시면 다 아직 고정은 확정은 화자5] 정 차장 쪽에서 이 내용을 알고 있나 모르고 있나 화자2] 이거 자체가 거기서 작성된 거예요. 장치 경 화자5] 자기네들은 자기네 DB의 ERP 시스템에 이렇게 들어가야 된다라고 그냥 얘기하는 걸 화자2] 아마 이 컬럼도 ERP 컬럼이랑 그렇죠 거기는 그거 패키지 갖다 쓰는 거니까 이게 패키지 갖다 ERP 컬럼이죠. 화자5] TRN하고 이거를 연결시키는 화자2] 그거는 모르겠고 이건 필요하다라고 화자2] 그러니까 컬럼이 도대체 이해가 안 된다. 그럼 ERP 쪽에다 의미를 물어보고 TRM에다가 그런 의미라는데 그런 컬럼이 혹시 뭐야 이렇게 물어봐야 되는 화자2] 그래서 화자2] 오늘 내일 잘 정리해서 주시면 취합해서 노트북은 뭐 제가 하나 가져가도 화자2] 목요일에 가셨다가 저 저희한테도 필요할 만한 이런 게 있으면은 갔다 와서 저희한테 화자3] 네 바로 고유 남기던지. ",
		"passage_Cnt": 1040
	},
	"Annotation": {
		"summary1": "ERP 시스템의 코드 고정 값 여부와 연동 시스템(TRM 등) 간 데이터 구조에 관한 논의로, 운영 계획과 원격 접근 방식에서의 어려움을 포함해 ERP와 연동되는 필수 데이터의 정의와 이해가 필요함을 강조합니다. 참여자들은 각자 문서와 데이터를 정리해 취합할 계획이며, 회의 일정에 따라 노트북을 통해 데이터를 확인하면서 신용준 매니저에게 필요 시 문의하고, ERP팀과 협업하여 필요한 사항을 확인할 예정입니다. 연동 시스템의 모든 컬럼이 필수는 아니며, 특정 값이 고정인지 예시인지를 파악하여 데이터 구조를 검토하고, 각자 정리한 자료를 기반으로 업무를 진행하고 협업하는 방식으로 프로젝트를 추진하려 합니다.",
		"summary2": "ERP 시스템의 코드 고정 값 여부와 연동 시스템(TRM 등) 간 데이터 구조에 관한 논의로, 운영 계획과 원격 접근 방식에서의 어려움을 포함해 ERP와 연동되는 필수 데이터의 정의와 이해가 필요함을 강조합니다. 참여자들은 각자 문서와 데이터를 정리해 취합할 계획이며, 회의 일정에 따라 노트북을 통해 데이터를 확인하면서 신용준 매니저에게 필요 시 문의하고, ERP팀과 협업하여 필요한 사항을 확인할 예정입니다. 연동 시스템의 모든 컬럼이 필수는 아니며, 특정 값이 고정인지 예시인지를 파악하여 데이터 구조를 검토하고, 각자 정리한 자료를 기반으로 업무를 진행하고 협업하는 방식으로 프로젝트를 추진하려 합니다.",
		"summary3": null,
		"summary_3_cnt": null
	}
}
